[
    {
        "title": "Salmon Greek Salad with Lemon Basil Dressing",
        "featured": false,
        "image" : "meal_1",
        "description": "Light, fresh and healthy grilled salmon Greek salad. Crisp vegetables are tossed in a tangy lemon basil dressing and topped with salmon.",
        "prepTime": "10 minutes",
        "cookTime": "35 minutes",
        "totalTime": "45 minutes",
        "servings": 2,
        "highlights": [
            "Light",
            "Fresh",
            "Healthy!"
        ],
        "summary": {
            "rating":"5",
            "serves":"2",
            "preparation" : "10 minutes",
            "cooking" : "35 minutes"
        },
        "category":"Special Dishes",
        "ingredients":
        [
            {"name": "16 oz. Salmon Fillets (4 x 4oz pieces)"},
            {"name": "Olive Oil, as needed"},
            {"name": "Kosher Salt, as needed"},
            {"name": "Black Pepper"},
            {"name": "8 cups Lettuce, Romaine, Spinach or Kale"},
            {"name": "1 cup Tomato"},
            {"name": "1 cup Cucumber, diced, ¼-inch thick"},
            {"name": "½ cup Red Onion, thinly sliced"},
            {"name": "½ cup Red Bell Pepper, diced, ¼-inch thick"},
            {"name": "4 oz. Feta Cheese, crumbled"},
            {"name": "½ cup Walnuts,roughly chopped"},
            {"name": "¼ cup Lemon Juice, plus zest of one lemon"},
            {"name": "½ cup Olive Oil"},
            {"name": "1 tbspDijon Mustard"},
            {"name": "1 tsp Honey"},
            {"name": "2 Garlic Cloves, minced"},
            {"name": "8 Basil Leaves, fresh"},
            {"name": "½ tsp Dried Oregano, or 1 tsp fresh"},
            {"name": "¼ tsp Kosher Salt"},
            {"name": "⅛ tsp Black Pepper, freshly cracked"}
        ],
        "directions":
        [
            "Lightly season both sides of the salmon fillet with salt and pepper. Drizzle a small amount of olive oil on both sides to coat.",
            "Heat grill to medium-high. Add a small amount of vegetable oil on a folded piece of paper towel, and then carefully grease the grill grates.",
            "Once the grill is nice and hot, add the salmon fillets. Cook uncovered about 4 to 5 minutes on each side until flaky (about 130-140°F).",
            "Remove the salmon from the grill and transfer to a clean plate, cover to keep warm. Remove the skin if still attached.",
            "In a large bowl add salad ingredients; lettuce, tomatoes, cucumber, red onion, bell pepper, cheese, and walnuts. Set aside.",
            "Add lemon juice, zest, olive oil, mustard, honey, garlic, basil, oregano, salt, and pepper in a blender.",
            "Blend until well combined and a slightly thick and opaque dressing is achieved, about 30 seconds. Add more salt and pepper as desired."
        ]
    },
    
    {
        "title": "Fusilli Pasta with Spinach and Tomatoes",
        "featured": false,
        "image" : "meal_2",
        "description": "Fusilli Pasta with spinach tomatoes and mushrooms! Make this quick and delicious, easy weeknight dinner! Your family will love this!",
        "prepTime": "10 minutes",
        "cookTime": "25 minutes",
        "totalTime": "35 minutes",
        "servings": 2,
        "highlights": [
            "Quick",
            "Delicious",
            "Easy!"
        ],
        "summary": {
            "rating":"5",
            "serves":"2",
            "preparation" : "10 minutes",
            "cooking" : "25 minutes"
        },
        "category":"Special Dishes",
        "ingredients":
        [
            {"name": "1 lb. Fusilli Pasta"},
            {"name": "½ - 1 lb. Lean Ground Beef or Ground Turkey"},
            {"name": "1-2 tbsp Olive Oil"},
            {"name": "1-2 tsp Crushed Garlic"},
            {"name": "½ cup Chicken Stock"},
            {"name": "1 bag Baby Spinach"},
            {"name": "1 cup Onion, chopped"},
            {"name": "½ cup Bell Peppers, assorted and chopped"},
            {"name": "½ cup Cherry Tomatoes, sliced"},
            {"name": "2-4 tbsp Tomato Paste"},
            {"name": "1-2 cups Mushroom Cremini or White Mushrooms"},
            {"name": "Mozzarella or Parmesan Cheese, for sprinkling"},
            {"name": "Salt & Pepper, to taste"}
        ],
        "directions":
        [
            "Wash and cut all of the vegetables; set aside",
            "Cook pasta according to package directions. Drain and set aside.",
            "In a large skillet or wok, over medium high heat, add 1-2 tbsp olive oil and cook the ground beef.",
            "After the ground beef is browned and cooked, (feel free to discard any fat) add the chicken stock, tomatoes, mushrooms, spinach and all of the vegetables. (For the spinach, I literally just throw the entire bag straight in)",
            "Add the tomato paste, mix and season with salt and pepper to taste",
            "Gently toss ingredients together until the spinach is wilted and all of the vegetables are cooked through",
            "Add the pasta and gently toss some more. Taste and season with more salt and pepper if needed. Sprinkle with fresh parmesan cheese and serve!"
        ]
    },
    
    {
        "title": "Macadamia-crusted fish with green beans",
        "featured": false,
        "image" : "meal_3",
        "description": "Macadamia-crusted fish with asparagus and green beans. Melt-in-your mouth fish with a tasty crust is perfect for a nutritious weeknight.",
        "prepTime": "10 minutes",
        "cookTime": "15 minutes",
        "totalTime": "25 minutes",
        "servings": 2,
        "highlights": [
            "Nutritious",
            "Perfect",
            "Melts in your mouth!"
        ],
        "summary": {
            "rating":"5",
            "serves":"2",
            "preparation" : "10 minutes",
            "cooking" : "15 minutes"
        },
        "category":"Special Dishes",
        "ingredients":
        [
            {"name": "2 tbsp Olive Oil"},
            {"name": "4 Skinless, Blue-eye Fillets (180g each)"},
            {"name": "1 cup Roasted Macadamia Nuts (150g), roughly chopped"},
            {"name": "1 tbsp Tarragon, finely chopped"},
            {"name": "1 tbsp Parsley, finely chopped. flat-leafed"},
            {"name": "1 large Garlic Clove, crushed"},
            {"name": "1 tbsp Macadamia Butter"},
            {"name": "Blanched Asparagus, Green Beans and Lemon Wedges, to serve"}
        ],
        "directions":
        [
            "Preheat the grill to medium-high. Heat oil in a large frypan over medium-high heat.",
            "Season fish all over with salt and pepper.",
            "Cook for 3 minutes each side until just cooked. Transfer to a lined baking tray.",
            "Meanwhile, combine nuts, herbs and garlic in a bowl. Evenly spread 1 teaspoon macadamia butter over the top of each fillet, then top with nut mixture, pressing down well to coat.",
            "Place under grill for a further 1-2 minutes until golden. Serve fish with vegetables and lemon wedges."
        ]
    },
    
    {
        "title": "Grilled Salmon with Foil-Pack Sesame Broccoli",
        "featured": false,
        "image" : "meal_4",
        "description": "Grilled salmon come together quickly with just a few simple ingredients. Making this grilled salmon makes it moist, tender.",
        "prepTime": "10 minutes",
        "cookTime": "30 minutes",
        "totalTime": "40 minutes",
        "servings": 2,
        "highlights": [
            "Moist",
            "Healthy",
            "Simple!"
        ],
        "summary": {
            "rating":"5",
            "serves":"2",
            "preparation" : "10 minutes",
            "cooking" : "30 minutes"
        },
        "category":"Special Dishes",
        "ingredients":
        [
            {"name": "6 cups Broccoli Florets"},
            {"name": "2 Carrots, sliced ¼-inch thick on an angle"},
            {"name": "1 tbsp Vegetable Oil"},
            {"name": "Kosher Salt and freshly ground Black Pepper"},
            {"name": "1 tsp Sesame Oil, toasted"},
            {"name": "4 Wild Salmon Fillets, center cut skin-on (6oz each)"},
            {"name": "1 tsp Toasted Sesame Seeds"},
            {"name": "Chili Garlic Sauce, for serving"}
        ],
        "directions":
        [
            "Prepare an outdoor grill for medium-high heat.",
            "Toss the broccoli, carrots, vegetable oil and a sprinkle of salt and a few grinds of pepper together on an 18-inch-long piece of heavy-duty aluminum foil. Bring the two long sides of foil up and together and fold over twice to seal. Bring the other two short sides up and in, crimping to seal; set aside.",
            "Lightly oil half of the grill grates. Pat the fish dry and sprinkle with salt and pepper. Put the vegetable pack on the un-oiled side of the grill and cook until the vegetables are crisp tender and the broccoli is bright green and lightly charred, about 10 minutes.",
            "Grill the salmon on the oiled side and skin-side up until well-marked, 3 to 4 minutes. Flip the salmon over and continue to grill until just cooked through but still a bit rosy in the center, 3 to 4 minutes more.",
            "Careful of the steam, open the foil pack and toss well; divide among 4 plates and add a piece of salmon.",
            "Top the salmon with a small spoonful of chili garlic sauce and sprinkle the vegetables with some sesame seeds and a drizzle with some sesame oil."
        ]
    }
]
